35. Написать программу, которая выводит на экран имя сына Гомера Симпсона.
```
#include <stdio.h>

int main()
{
    printf("Bart Simpson\n");
    getchar();

    return 0;
}
```
36. Написать программу, которая выводит на экран имена детей Гомера и Мардж Симпсонов (имя каждого — с новой строки).
```
#include <stdio.h>

int main()
{
    printf("Bart Simpson\nLisa Simpson\nMaggi Simpson\n");
    printf("To exit press <Enter>");
    getchar();

    return 0;
}
```
37. Написать программу, которая выводит на экран имена детей Гомера и Мардж Симпсонов (имя каждого — с новой строки).
```
#include <stdio.h>
#include <string.h>

char* rus(char st[])
{
    char* st2 = new char[strlen(st) + 2];

    int i = 0;

    while (st[i] != 0) {
        unsigned char ch = st[i];
        if ((ch >= 192) && (ch <= 255)) {
            if (ch < 240)
                st2[i] = st[i] - 64;
            else
                st2[i] = st[i] - 16;
        }
        else
            st2[i] = st[i];
        ++i;
    }
    st2[i] = 0;
    return st2;
}

int main()
{
    printf(rus("Барт Симпсон\n"));

    return 0;
}
```
38. Написать инструкцию вывода значений переменных а, b и с (типа float) с пятью цифрами в целой части и тремя — в дробной. Значения должны быть выведены в виде: a = значение b = значение с = значение.
```
#include <stdio.h>

int main()
{
    float a = 1.222, b = 2.123123, c = 12345678.2333333;

    printf("a=%5.3f\tb=%5.3f\tc=%5.3f", a, b, c);

    return 0;
}
```
39. Написать инструкцию вывода значений переменных h и w (типа float), которые содержат значения высоты и длины прямоугольника. Перед значением переменной должен идти пояснительный текст (Height = Width =), а после — единица измерения (sm).
```
#include <stdio.h>

int main()
{
    float h = 4.12312, w = 123.1412;
    printf("Height = %f,     Width = %f", h, w);
    return 0;
}
```
40. Написать инструкцию, которая выводит в одной строке значения переменных тип целого типа (int).
```
#include <stdio.h>

int main()
{
    int m = 12, n = 13;
    printf("m=%i\tn=%i\n", m, n);
    return 0;
}
```
41. Написать инструкцию вывода значений целых переменных а, b и с. Значение каждой переменной должно быть выведено в отдельной строке.
```
#include <stdio.h>

int main()
{
    int a = 1, b = 2, c = 3;
    printf("a=%i\nb=%i\nc=%i\n", a, b, c);
    return 0;
}
```
42. Написать инструкции вывода значений дробных переменных х! и х2. На экране перед значением переменной должен быть выведен поясняющий текст, представляющий собой имя переменной, за которым следует знак «равно».
```
#include <stdio.h>

int main()
{
    double x1 = 123.321, x2 = 345.543;
    printf("double x1 = %d\ndouble x2 = %d\n", x1, x2);
    return 0;
}
```
