43. Написать программу, которая выводит палитру — фразу Hello, World! всеми возможными для консольного приложения цветами. Перед каждой фразой необходимо указать код цвета, которым она выведена.
```
#include <stdio.h>
#include <iostream>
#include <windows.h>

int main()
{
    HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE);

    for (int i = 0; i < 16; ++i) {
        SetConsoleTextAttribute(hConsole, i);
        std::cout << i << " - Hello, World!\n";
    }
    return 0;
}
```
44. Написать программу, которая выводит на экран в трех строках слово RUSSIA. Первая строка должна быть выведена белым, вторая — синим, третья — красным цветом.
```
#include <stdio.h>
#include <iostream>
#include <windows.h>

#define WHITE       7
#define GRAY        8
#define BLUE        9
#define GREEN       10
#define BLUE_LIGHT  11
#define RED         12
#define MAGNETA     13
#define YELLOW      14
#define WHITE_LIGHT 15

int main()
{
    HANDLE hConsole = GetStdHandle(STD_OUTPUT_HANDLE);

    SetConsoleTextAttribute(hConsole, WHITE_LIGHT);
    std::cout << "RUSSIA" << std::endl;

    SetConsoleTextAttribute(hConsole, BLUE);
    std::cout << "RUSSIA" << std::endl;

    SetConsoleTextAttribute(hConsole, RED);
    std::cout << "RUSSIA" << std::endl;

    return 0;
}
```
